[A_heal_immunity H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Невосприимчивость к магии"
mTooltip="Существо не может быть целью негативных заклинаний или эффектов любой школы магии. Весь магический урон от вражеских атак снижен на 50%."

[Anti_heal.A_IceStrike_Buff H7BaseBuff]
mName="Застывшее исцеление"
mTooltip="Существо больше не может получать лечение или лечить себя. Длительность (ходов): %durnow. (Не действует на конструктов)."

[Anti_heal.A_Nova H7HeroAbility]
mTooltipMagicGuild="Выбранное существо больше не может получать лечение или лечить себя. (Не действует на конструктов)."
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Застывшее исцеление"
mTooltip="Наносит %d ед. урона от %icon_water магии воды. Существо больше не может быть вылечено. Длительность (ходов): %buff1.buff.durini. (Не действует на конструктов)."

[Armure_de_givre.A_armure_givre_Buff H7BaseBuff]
mName="Ледяная броня"
mTooltip="Существо получает %stat1 %icon_defense и замораживает врагов, которые атакуют его в ближнем бою. Длительность (ходов): %durnow."

[Armure_de_givre.A_BurningDetermination H7HeroAbility]
mTooltipMagicGuild="Увеличивает защиту выбранного союзника и замораживает всех врагов, которые атакуют его в ближнем бою."
mTooltipMagicGuildRankLine=""
mTooltipUpgraded="Увеличивает защиту выбранных союзников в области 4x4 на  %buff1.buff.stat1 %icon_defense и замораживает всех врагов, которые атакуют их в ближнем бою в течение %buff1.buff.durini ходов."
mName="Ледяная броня"
mTooltip="Увеличивает защиту выбранного союзника на by %buff1.buff.stat1 и замораживает всех врагов, которые атакуют его в ближнем бою в течение %buff1.buff.durini ходов."

[Ice_lance.A_Nova H7HeroAbility]
mTooltipMagicGuild="Наносит урон от магии %d.icon воды всем существам на линии атаки и замораживает их с вероятностью 30%."
mTooltipMagicGuildRankLine="от %d.min до %d.max ед. урона %d.icon"
mTooltipUpgraded="Наносит от %d.min до %d.max ед. урона от %d.icon магии воды в области поражения и замораживает врагов с вероятностью 60%."
mName="Ледяное копьё"
mTooltip="Наносит от %d.min до %d.max ед. урона от %d.icon магии воды в области поражения и замораживает врагов с вероятностью 30%."

